fine_valve/stator/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{    
    inlet
    {
       
		type            inletOutlet;
        inletValue      uniform (0 0 0);
		value			uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }	
	wall
	{
		type 			fixedValue;
		value			uniform (0 0 0);
	}
    AMI2
    {
        type            cyclicAMI;
		value			$internalField;
    }
    valve
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
	AMI1
	{
		type			cyclicAMI;
		value			$internalField;
	}
}


// ************************************************************************* //
