fine_valve/stator/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0495;

boundaryField
{   
    inlet
    {
        type            inletOutlet;
		inletValue      $internalField;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
	AMI2
	{
		type			cyclicAMI;
		inletValue      $internalField;
	}
	valve
	{
		type            epsilonWallFunction;
		value           $internalField;
	}
	AMI1
	{
		type			cyclicAMI;
		inletValue      $internalField;
	}
}


// ************************************************************************* //
